brew "ack"
brew "automake"
brew "awk"
brew "bash"
brew "bat"
brew "bitwarden-cli"
brew "buf"
brew "clojure-lsp"
brew "coreutils", link: false
brew "dos2unix"
brew "fd"
brew "firebase-cli"
brew "fzf"
brew "gh"
brew "git"
brew "git-flow"
brew "gnu-getopt"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "gpg"
brew "gradle"
brew "groovy"
brew "htop"
brew "hugo"
brew "inetutils"
brew "instrumenta/instrumenta/conftest"
brew "jenv"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "leiningen"
brew "libpq", link: true
brew "maven"
brew "md5sha1sum", link: false
brew "mdcat"
brew "ncdu"
brew "ncurses"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "openjdk@8"
brew "p7zip"
brew "parallel"
brew "pass"
brew "pinentry-mac"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.9"
brew "ripgrep"
brew "ruby"
brew "rustup-init"
brew "sipcalc"
brew "starship"
brew "tcptraceroute"
brew "terraform-docs"
brew "tflint"
brew "tilt-dev/tap/tilt"
brew "tmux"
brew "tokiwong/tap/helm-switcher"
brew "txn2/tap/kubefwd"
brew "unbound"
brew "warrensbox/tap/tfswitch"
brew "watch"
brew "wget"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zlib"
cask "1password"
cask "adoptopenjdk/openjdk/adoptopenjdk8"
cask "adoptopenjdk11"
cask "adoptopenjdk14"
cask "amazon-music"
cask "android-studio"
cask "bitwarden"
cask "calibre"
cask "dbeaver-community"
cask "finicky"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "gimp"
cask "github"
cask "google-cloud-sdk"
cask "inkscape"
cask "kap"
cask "macvim"
cask "miro"
cask "mongodb-realm-studio"
cask "monitorcontrol"
cask "notion"
cask "rectangle"
cask "signal"
cask "slack"
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"
cask "visualvm"
cask "vlc"
cask "wireshark"
cask 'amazon-music'
cask 'android-platform-tools'
cask 'cockatrice'
cask 'rancher'
cask 'todoist'
tap "adoptopenjdk/openjdk"
tap "bufbuild/buf"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "instrumenta/instrumenta"
tap "tilt-dev/tap"
tap "tokiwong/tap"
tap "txn2/tap"
tap "warrensbox/tap"
cask 'kindle'
