# Brewfile — single source of truth for Homebrew installs.
# Applied by ~/Code/bin/setup-mac.sh via `brew bundle`.
# Language runtimes (node, python, ruby, java, etc.) are intentionally NOT here;
# they are managed by asdf (see .tool-versions).

# Formulae
brew "asdf"
brew "awscli"
brew "bitwarden-cli"
brew "cloud-sql-proxy"
brew "cocoapods"
brew "curl"
brew "docker"
brew "emacs"
brew "firebase-cli"
brew "fzf"
brew "gh"
brew "git"
brew "go-task"
brew "imagemagick"
brew "jq"
brew "lsd"
brew "mas"
brew "postgresql@18"
brew "powerlevel10k"
brew "pv"
brew "python-yq"
brew "tailscale"
brew "tesseract"
brew "tmux"

# Casks — applications
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "asana"
cask "bettertouchtool"
cask "chatgpt"
cask "claude"
cask "clipy"
cask "cockatrice"
cask "cursor"
cask "dbeaver-community"
cask "dialpad"
cask "discord"
cask "disk-inventory-x"
cask "docker-desktop"
cask "elgato-stream-deck"
cask "epic-games"
cask "fathom"
cask "flutter"
cask "gcloud-cli"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "logi-options-plus"
cask "ngrok"
cask "notion"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "visual-studio-code"
cask "windows-app"
cask "zoom"

# Casks — Android development (licenses accepted by setup-mac.sh)
cask "android-commandlinetools"
cask "android-ndk"
cask "android-platform-tools"
cask "android-studio"

# Casks — Nerd Fonts (Meslo recommended for Powerlevel10k)
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"

# Mac App Store apps
mas "Bitwarden", id: 1352778147
mas "Magnet", id: 441258766
mas "Speedtest", id: 1153157709
mas "Step Two", id: 1448916662
mas "Telegram", id: 747648890
mas "Transporter", id: 1450874784
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
